pd_disagg/results/b1_matrix/raw/20260821T1743_colocate_8192x128_saturation_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70347d9db060>, trust_remote_code=False, seed=42, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=8192, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8100, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/b1_matrix/raw', result_filename='20260821T1743_colocate_8192x128_saturation_bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-efb3ba6e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-21 17:43:30 [utils.py:90] Sampling input_len from [8192, 8192] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 64/64 [01:11<00:00,  1.12s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  71.72     
Total input tokens:                      524288    
Total generated tokens:                  8192      
Request throughput (req/s):              0.89      
Output token throughput (tok/s):         114.23    
Peak output token throughput (tok/s):    630.00    
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          7424.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          34260.16  
Median TTFT (ms):                        34809.45  
P50 TTFT (ms):                           34809.45  
P90 TTFT (ms):                           61436.39  
P99 TTFT (ms):                           68799.46  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          107.21    
Median TPOT (ms):                        118.74    
P50 TPOT (ms):                           118.74    
P90 TPOT (ms):                           119.92    
P99 TPOT (ms):                           122.32    
---------------Inter-token Latency----------------
Mean ITL (ms):                           107.21    
Median ITL (ms):                         23.96     
P50 ITL (ms):                            23.96     
P90 ITL (ms):                            254.47    
P99 ITL (ms):                            261.70    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          47876.20  
Median E2EL (ms):                        50028.53  
P50 E2EL (ms):                           50028.53  
P90 E2EL (ms):                           69928.87  
P99 E2EL (ms):                           71650.06  
==================================================